Revit 2024 API
AnalysisDisplayColoredSurfaceSettings.Dispose Method
Releases all resources used by the AnalysisDisplayColoredSurfaceSettings
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public void Dispose()
Visual Basic
Public Sub Dispose
Visual C++
public:
virtual void Dispose() sealed
Implements
IDisposable.Dispose()
See Also
AnalysisDisplayColoredSurfaceSettings Class
Autodesk.Revit.DB.Analysis Namespace